import projectImg from '../../assets/img/projects/Снимок экрана 2024-11-30 150026.jpg';

export const PROJECTS = [
  {
    url: '#1',
    title:
      'Очень длинное название проекта в две строки и не влазит чень длинное название проекта в две строки и не влазит',
    popupData: {
      title: 'Название организации',
      imageUrl: projectImg,
    },
  },
  {
    url: '#2',
    title:
      'Очень длинное название проекта в две строки и не влазит чень длинное название проекта в две строки и не влазит',
    popupData: {
      title: 'Название организации',
      imageUrl: projectImg,
    },
  },
  {
    url: '#3',
    title:
      'Очень длинное название проекта в две строки и не влазит чень длинное название проекта в две строки и не влазит',
    popupData: {
      title: 'Название организации',
      imageUrl: projectImg,
    },
  },
  {
    url: '#4',
    title:
      'Очень длинное название проекта в две строки и не влазит чень длинное название проекта в две строки и не влазит',
    popupData: {
      title: 'Название организации',
      imageUrl: projectImg,
    },
  },
];
