{
  "hunks": [
    "С 2021 года занимаюсь фронтенд-разработкой. Убеждён, что прочная база в HTML, CSS и JavaScript — основа для уверенной работы. Поэтому стараюсь основе уделять достаточное внимание.",
    "Однако для более эффективной разработки выбрал React и на данный момент позиционирую себя как React-разработчик.",
    "Считаю, что использование любой библиотеки или фреймворка без понимания основ фронтенда ведёт к поверхностному освоению технологии.",
    "В портфолио есть проекты, выполненные без фреймворков и сторонних библиотек — на чистом JavaScript и SCSS.",
    "Среди них есть объемные проекты такие как интернет-магазин.",
    "Эти проекты позволили глубже разобраться в возможностях нативного JavaScript и лучше понять, как работают ключевые механизмы фронтенда.",
    "Последние проекты я делаю на React с использованием TypeScript. Среди них — интернет-магазин с бэкендом, а так же и этот, просмативаемый сайт.",
    "В процессе реализации проектов на React использовал сторонние библиотеки Redux, React Query, React Hook Form, Tailwind, Styled Components и другие укрепляя ключевые навыки.",
    "В прошлом работал программистом с использованием Delphi и T-SQL для MS SQL Server. Опыт разработки серверной логики помогает мне лучше понимать взаимодействие фронтенда с бэкэндом.",
    "Ищу проект, где смогу применить свои знания React TypeScript, одновременно расширяя профессиональный кругозор. Для меня важно, чтобы был баланс между решением задач и изучением новых технологий.",
    "Хочу работать в команде, где  стремятся соблюдать хорошие практики и уделяют внимание качеству кода.",
    "Мои работы — примеры верстки сложных интерфейсов с анимацией, выпадающими списками и попапами, а также проекты на React с применением TypeScript. Ссылки на проекты и их исходники доступны в разделе проектов и на GitHub."
  ],
  "paragraphsByScreenSize": {
    "pc": [
      { "from": 0, "to": 1 },
      { "from": 1, "to": 4 },
      { "from": 4, "to": 8 },
      { "from": 8 }
    ],
    "tablet": [{ "from": 0, "to": 2 }, { "from": 2, "to": 7 }, { "from": 7 }],
    "mobile": [{ "from": 0, "to": 1 }, { "from": 1, "to": 11 }, { "from": 11 }],
    "mobileSmall": [
      [
        { "from": 0, "to": 2, "isConcat": true },
        { "from": 2, "to": 3 }
      ],
      [
        { "from": 3, "to": 5, "isConcat": true },
        { "from": 5, "to": 7, "isConcat": true }
      ],
      { "from": 7, "to": 9 },
      [{ "from": 9, "to": 11, "isConcat": true }, { "from": 11 }]
    ],
    "mobileUltraSmall": [
      [
        { "from": 0, "to": 1 },
        { "from": 1, "to": 3, "isConcat": true }
      ],
      [
        { "from": 3, "to": 5, "isConcat": true },
        { "from": 5, "to": 7, "isConcat": true }
      ],
      { "from": 7, "to": 9 },
      [
        { "from": 9, "to": 10 },
        { "from": 10, "to": 12, "isConcat": true }
      ]
    ]
  }
}
