import { TPuzzleProps } from '../ui/Puzzle/Puzzle.types';

export const FACTS: { variant: TPuzzleProps['variant']; text: string }[] = [
  {
    variant: 'fact-1',
    text: 'Нравятся компьютеры 🖥️ c детства.',
  },
  {
    variant: 'fact-2',
    text: 'Люблю то, чем занимаюсь.',
  },
  {
    variant: 'fact-3',
    text: 'Стараюсь быть позитивным 😁',
  },
  {
    variant: 'fact-4',
    text: 'Я симпатичный и скромный 😊',
  },
  {
    variant: 'fact-5',
    text: 'Я вдумчивый и детальный.',
  },
  {
    variant: 'fact-6',
    text: 'Я сообразительный и c чувством юмора 😜',
  },
  {
    variant: 'fact-7',
    text: 'Я самокритичен, поэтому всегда обучаюсь новому.',
  },
  {
    variant: 'fact-8',
    text: 'Люблю бег и плаванье. И регулярно этим занимаюсь.',
  },
  {
    variant: 'fact-9',
    text: 'Моя сестра — веб-дизайнер. Дизайн этого сайта выполнила она. Оживил макет я.',
  },
  {
    variant: 'fact-10',
    text: 'Мой первый компьютер — Вектор-06Ц',
  },
];
