export const paragraphs = [
  'Я — фронтенд-разработчик с нескрываемой страстью к созданию виртуальных миров через код. Моя история в мире программирования началась задолго до того, как я решился стать профессиональным разработчиком.',
  'С самого подросткового периода компьютеры и мир программирования привлекали меня своей магией. Уже тогда я начал погружаться в тонкости кода, изучая его, как искусство, и пробовать свои силы в создании простых программ. Увлечение это стало неотъемлемой частью моей жизни.',
  'Мой путь в мире разработки привёл меня в организацию, где я разработал программу, которой успешно пользуются до сих пор. К сожалению, не могу раскрыть многие детали из-за конфиденциальности. Это был для меня не только проект, но и своеобразный вызов, который позволил мне продемонстрировать свои навыки в создании эффективных и интуитивно понятных интерфейсов.',
  'Моя специализация в области информатики, полученная в процессе обучения на физико-математическом факультете, стала прочным фундаментом для моих знаний. Я всегда стремлюсь к совершенству и готов постоянно учиться.',
  'Моя страсть к коду и разработке привела меня к тому, что я не только создаю веб-приложения, но и глубоко анализирую их, чтобы обеспечивать пользователям наилучший опыт. Я верю, что в мире технологий нет предела совершенству, и я готов вкладывать свою энергию и знания в каждый проект.',
  'Прошу вас заглянуть в моё портфолио, чтобы увидеть проекты, которые я создал. Горю желанием принести свой вклад в вашу компанию/проект и продолжить развиваться в увлекательном мире фронтенд-разработки.',
];

export const paragraphsByScreenSize = {
  pc: [paragraphs[0], paragraphs[1], paragraphs[2], [paragraphs.slice(3)]],
  tablet: [paragraphs.slice(0, 2), paragraphs[2], paragraphs.slice(3)],
};
